cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id #This????
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Lul I has teh 1337 hax0rz "], ["updated_at", "2018-09-12 23:50:45.296879"], ["id", 7]]

  def owns_cat?
    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]