cats/app/models/user.rb

  def self.find_by_credentials(uname, pword)
    @user = User.find_by(username: uname)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "FierySwagger"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "oUZ-su3H9AqlI8XHvsBVSg"], ["updated_at", "2018-09-12 23:35:04.306154"], ["id", 5]]